MikroElektronika/core_packages/PIC/XC8/def/PIC18LF43K22/mcu.h
extern volatile ECCPASbits_t ECCPASbits __at(0xFB6);
// bitfield macros
#define _ECCPAS_P1SSBD_POSN                                 0x0
#define _ECCPAS_P1SSBD_POSITION                             0x0
#define _ECCPAS_P1SSBD_SIZE                                 0x2
#define _ECCPAS_P1SSBD_LENGTH                               0x2
#define _ECCPAS_P1SSBD_MASK                                 0x3
#define _ECCPAS_P1SSAC_POSN                                 0x2
#define _ECCPAS_P1SSAC_POSITION                             0x2
#define _ECCPAS_P1SSAC_SIZE                                 0x2
#define _ECCPAS_P1SSAC_LENGTH                               0x2
#define _ECCPAS_P1SSAC_MASK                                 0xC
#define _ECCPAS_CCP1AS_POSN                                 0x4
#define _ECCPAS_CCP1AS_POSITION                             0x4
#define _ECCPAS_CCP1AS_SIZE                                 0x3
#define _ECCPAS_CCP1AS_LENGTH                               0x3
#define _ECCPAS_CCP1AS_MASK                                 0x70
#define _ECCPAS_CCP1ASE_POSN                                0x7
#define _ECCPAS_CCP1ASE_POSITION                            0x7
#define _ECCPAS_CCP1ASE_SIZE                                0x1
#define _ECCPAS_CCP1ASE_LENGTH                              0x1
#define _ECCPAS_CCP1ASE_MASK                                0x80
#define _ECCPAS_P1SSBD0_POSN                                0x0
#define _ECCPAS_P1SSBD0_POSITION                            0x0
#define _ECCPAS_P1SSBD0_SIZE                                0x1
#define _ECCPAS_P1SSBD0_LENGTH                              0x1
#define _ECCPAS_P1SSBD0_MASK                                0x1
#define _ECCPAS_P1SSBD1_POSN                                0x1
#define _ECCPAS_P1SSBD1_POSITION                            0x1
#define _ECCPAS_P1SSBD1_SIZE                                0x1
#define _ECCPAS_P1SSBD1_LENGTH                              0x1
#define _ECCPAS_P1SSBD1_MASK                                0x2
#define _ECCPAS_P1SSAC0_POSN                                0x2
#define _ECCPAS_P1SSAC0_POSITION                            0x2
#define _ECCPAS_P1SSAC0_SIZE                                0x1
#define _ECCPAS_P1SSAC0_LENGTH                              0x1
#define _ECCPAS_P1SSAC0_MASK                                0x4
#define _ECCPAS_P1SSAC1_POSN                                0x3
#define _ECCPAS_P1SSAC1_POSITION                            0x3
#define _ECCPAS_P1SSAC1_SIZE                                0x1
#define _ECCPAS_P1SSAC1_LENGTH                              0x1
#define _ECCPAS_P1SSAC1_MASK                                0x8
#define _ECCPAS_CCP1AS0_POSN                                0x4
#define _ECCPAS_CCP1AS0_POSITION                            0x4
#define _ECCPAS_CCP1AS0_SIZE                                0x1
#define _ECCPAS_CCP1AS0_LENGTH                              0x1
#define _ECCPAS_CCP1AS0_MASK                                0x10
#define _ECCPAS_CCP1AS1_POSN                                0x5
#define _ECCPAS_CCP1AS1_POSITION                            0x5
#define _ECCPAS_CCP1AS1_SIZE                                0x1
#define _ECCPAS_CCP1AS1_LENGTH                              0x1
#define _ECCPAS_CCP1AS1_MASK                                0x20
#define _ECCPAS_CCP1AS2_POSN                                0x6
#define _ECCPAS_CCP1AS2_POSITION                            0x6
#define _ECCPAS_CCP1AS2_SIZE                                0x1
#define _ECCPAS_CCP1AS2_LENGTH                              0x1
#define _ECCPAS_CCP1AS2_MASK                                0x40
#define _ECCPAS_PSS1BD_POSN                                 0x0
#define _ECCPAS_PSS1BD_POSITION                             0x0
#define _ECCPAS_PSS1BD_SIZE                                 0x2
#define _ECCPAS_PSS1BD_LENGTH                               0x2
#define _ECCPAS_PSS1BD_MASK                                 0x3
#define _ECCPAS_PSS1AC_POSN                                 0x2
#define _ECCPAS_PSS1AC_POSITION                             0x2
#define _ECCPAS_PSS1AC_SIZE                                 0x2
#define _ECCPAS_PSS1AC_LENGTH                               0x2
#define _ECCPAS_PSS1AC_MASK                                 0xC
#define _ECCPAS_PSS1BD0_POSN                                0x0
#define _ECCPAS_PSS1BD0_POSITION                            0x0
#define _ECCPAS_PSS1BD0_SIZE                                0x1
#define _ECCPAS_PSS1BD0_LENGTH                              0x1
#define _ECCPAS_PSS1BD0_MASK                                0x1
#define _ECCPAS_PSS1BD1_POSN                                0x1
#define _ECCPAS_PSS1BD1_POSITION                            0x1
#define _ECCPAS_PSS1BD1_SIZE                                0x1
#define _ECCPAS_PSS1BD1_LENGTH                              0x1
#define _ECCPAS_PSS1BD1_MASK                                0x2
#define _ECCPAS_PSS1AC0_POSN                                0x2
#define _ECCPAS_PSS1AC0_POSITION                            0x2
#define _ECCPAS_PSS1AC0_SIZE                                0x1
#define _ECCPAS_PSS1AC0_LENGTH                              0x1
#define _ECCPAS_PSS1AC0_MASK                                0x4
#define _ECCPAS_PSS1AC1_POSN                                0x3
#define _ECCPAS_PSS1AC1_POSITION                            0x3
#define _ECCPAS_PSS1AC1_SIZE                                0x1
#define _ECCPAS_PSS1AC1_LENGTH                              0x1
#define _ECCPAS_PSS1AC1_MASK                                0x8
#define _ECCPAS_PSSBD_POSN                                  0x0
#define _ECCPAS_PSSBD_POSITION                              0x0
#define _ECCPAS_PSSBD_SIZE                                  0x2
#define _ECCPAS_PSSBD_LENGTH                                0x2
#define _ECCPAS_PSSBD_MASK                                  0x3
#define _ECCPAS_PSSAC_POSN                                  0x2
#define _ECCPAS_PSSAC_POSITION                              0x2
#define _ECCPAS_PSSAC_SIZE                                  0x2
#define _ECCPAS_PSSAC_LENGTH                                0x2
#define _ECCPAS_PSSAC_MASK                                  0xC
#define _ECCPAS_ECCPAS_POSN                                 0x4
#define _ECCPAS_ECCPAS_POSITION                             0x4
#define _ECCPAS_ECCPAS_SIZE                                 0x3
#define _ECCPAS_ECCPAS_LENGTH                               0x3
#define _ECCPAS_ECCPAS_MASK                                 0x70
#define _ECCPAS_ECCPASE_POSN                                0x7
#define _ECCPAS_ECCPASE_POSITION                            0x7
#define _ECCPAS_ECCPASE_SIZE                                0x1
#define _ECCPAS_ECCPASE_LENGTH                              0x1
#define _ECCPAS_ECCPASE_MASK                                0x80
#define _ECCPAS_PSSBD0_POSN                                 0x0
#define _ECCPAS_PSSBD0_POSITION                             0x0
#define _ECCPAS_PSSBD0_SIZE                                 0x1
#define _ECCPAS_PSSBD0_LENGTH                               0x1
#define _ECCPAS_PSSBD0_MASK                                 0x1
#define _ECCPAS_PSSBD1_POSN                                 0x1
#define _ECCPAS_PSSBD1_POSITION                             0x1
#define _ECCPAS_PSSBD1_SIZE                                 0x1
#define _ECCPAS_PSSBD1_LENGTH                               0x1
#define _ECCPAS_PSSBD1_MASK                                 0x2
#define _ECCPAS_PSSAC0_POSN                                 0x2
#define _ECCPAS_PSSAC0_POSITION                             0x2
#define _ECCPAS_PSSAC0_SIZE                                 0x1
#define _ECCPAS_PSSAC0_LENGTH                               0x1
#define _ECCPAS_PSSAC0_MASK                                 0x4
#define _ECCPAS_PSSAC1_POSN                                 0x3
#define _ECCPAS_PSSAC1_POSITION                             0x3
#define _ECCPAS_PSSAC1_SIZE                                 0x1
#define _ECCPAS_PSSAC1_LENGTH                               0x1
#define _ECCPAS_PSSAC1_MASK                                 0x8
#define _ECCPAS_ECCPAS0_POSN                                0x4
#define _ECCPAS_ECCPAS0_POSITION                            0x4
#define _ECCPAS_ECCPAS0_SIZE                                0x1
#define _ECCPAS_ECCPAS0_LENGTH                              0x1
#define _ECCPAS_ECCPAS0_MASK                                0x10
#define _ECCPAS_ECCPAS1_POSN                                0x5
#define _ECCPAS_ECCPAS1_POSITION                            0x5
#define _ECCPAS_ECCPAS1_SIZE                                0x1
#define _ECCPAS_ECCPAS1_LENGTH                              0x1
#define _ECCPAS_ECCPAS1_MASK                                0x20
#define _ECCPAS_ECCPAS2_POSN                                0x6
#define _ECCPAS_ECCPAS2_POSITION                            0x6
#define _ECCPAS_ECCPAS2_SIZE                                0x1
#define _ECCPAS_ECCPAS2_LENGTH                              0x1
#define _ECCPAS_ECCPAS2_MASK                                0x40

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0xFB7);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0FB7h");
#endif
// aliases
extern volatile unsigned char           PWMCON              __at(0xFB7);
#ifndef _LIB_BUILD
asm("PWMCON equ 0FB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1DC                   :7;
        unsigned P1RSEN                 :1;
    };
    struct {
        unsigned P1DC0                  :1;
        unsigned P1DC1                  :1;
        unsigned P1DC2                  :1;
        unsigned P1DC3                  :1;
        unsigned P1DC4                  :1;
        unsigned P1DC5                  :1;
        unsigned P1DC6                  :1;
    };
    struct {
        unsigned PDC                    :7;
        unsigned PRSEN                  :1;
    };
    struct {
        unsigned PDC0                   :1;
        unsigned PDC1                   :1;
        unsigned PDC2                   :1;
        unsigned PDC3                   :1;
        unsigned PDC4                   :1;
        unsigned PDC5                   :1;
        unsigned PDC6                   :1;
    };
} PWM1CONbits_t;
